In [1]:
import pandas as pd
import sqlite3

In [7]:
# Conectamos con la base de datos chinook.db
connection = sqlite3.connect("sql-murder-mystery.db")

# Obtenemos un cursor que utilizaremos para hacer las queries
crsr = connection.cursor()

In [8]:
# Con esta funci√≥n leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):

    # Ejecuta la query
    crsr.execute(query)

    # Almacena los datos de la query 
    ans = crsr.fetchall()

    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in crsr.description]

    return pd.DataFrame(ans,columns=names)

In [21]:
query = '''
SELECT DESCRIPTION
FROM crime_scene_report
where type like 'murder' and date like '20180115' and city LIKE 'SQL CITY'

'''
sql_query(query)

# Security footage shows that there were 2 witnesses. The first witness 
# lives at the last house on "Northwestern Dr". 
# The second witness, named Annabel, lives somewhere on "Franklin Ave".

                                         description
0  Security footage shows that there were 2 witne...

In [25]:
query = '''
SELECT name, address_number, address_street_name, id
FROM person
where address_street_name = "Northwestern Dr"
order by address_number desc
limit 1

'''
sql_query(query)

             name  address_number address_street_name     id
0  Morty Schapiro            4919     Northwestern Dr  14887

In [24]:
query = '''
SELECT name, address_number, address_street_name, id
FROM person
where address_street_name = "Franklin Ave" and name like 'Annabel%'
order by address_number desc
limit 1

'''
sql_query(query)

             name  address_number address_street_name     id
0  Annabel Miller             103        Franklin Ave  16371

In [ ]:
query = '''
SELECT transcript
FROM interview
where person_id = 16371 or person_id = 14887

'''
sql_query(query)

# I saw the murder happen, and I recognized the killer from my gym when
# I was working out last week on January the 9th.

# I heard a gunshot and then saw a man run out. 
# He had a "Get Fit Now Gym" bag. The membership number 
# on the bag started with "48Z". Only gold members have those bags. 
# The man got into a car with a plate that included "H42W".

                                          transcript
0  I heard a gunshot and then saw a man run out. ...
1  I saw the murder happen, and I recognized the ...

In [28]:
query = '''
SELECT id
FROM get_fit_now_member
where person_id = 16371

'''
sql_query(query)

      id
0  90081

In [ ]:
query = '''
SELECT *
FROM get_fit_now_check_in
where check_in_date like '20180109'
'''
sql_query(query)

# 48Z7A y 48Z55

  membership_id  check_in_date  check_in_time  check_out_time
0         X0643       20180109            957            1164
1         UK1F2       20180109            344             518
2         XTE42       20180109            486            1124
3         1AE2H       20180109            461             944
4         6LSTG       20180109            399             515
5         7MWHJ       20180109            273             885
6         GE5Q8       20180109            367             959
7         48Z7A       20180109           1600            1730
8         48Z55       20180109           1530            1700
9         90081       20180109           1600            1700

In [45]:
query = '''
SELECT person_id, name
FROM get_fit_now_member
where id = '48Z55' or id = '48Z7A' 

'''
sql_query(query)

   person_id           name
0      67318  Jeremy Bowers
1      28819   Joe Germuska

In [49]:
# "H42W".

query = '''
SELECT id, name, license_id
FROM person
where id = '67318' or id = '28819' 

'''
sql_query(query)

      id           name  license_id
0  28819   Joe Germuska      173289
1  67318  Jeremy Bowers      423327

In [ ]:
# "H42W".

query = '''
SELECT id, plate_number
FROM drivers_license
where plate_number like "%H42W%"

'''
sql_query(query)

#JEREMY ES EL ASESINO

       id plate_number
0  183779       H42W0X
1  423327       0H42W2
2  664760       4H42WR

In [ ]:
query = '''
SELECT Transcript
FROM interview
where person_id = '67318'

'''
sql_query(query)

# I was hired by a woman with a lot of money. 
# I don't know her name but I know she's around 5'5"'' (65") or 5'7" (67"). 
# # She has red hair and she drives a Tesla Model S.
# I know that she attended the SQL Symphony Concert 3 times in December 2017.

                                          transcript
0  I was hired by a woman with a lot of money. I ...

In [57]:
query = '''
SELECT *
FROM drivers_license
where hair_color = 'red' and car_model = "Model S" and gender = "female"
'''
sql_query(query)

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,202298,68,66,green,red,female,500123,Tesla,Model S
1,291182,65,66,blue,red,female,08CM64,Tesla,Model S
2,918773,48,65,black,red,female,917UU3,Tesla,Model S

In [59]:
query = '''
SELECT *
FROM person
where license_id = '202298' or license_id ='291182' or license_id ='918773'
'''
sql_query(query)

,id,name,license_id,address_number,address_street_name,ssn
0,78881,Red Korb,918773,107,Camerata Dr,961388910
1,90700,Regina George,291182,332,Maple Ave,337169072
2,99716,Miranda Priestly,202298,1883,Golden Ave,987756388

In [62]:
query = '''
SELECT *
FROM facebook_event_checkin
where person_id = '78881' or person_id ='90700' or person_id ='99716' 
'''
sql_query(query)

   person_id  event_id            event_name      date
0      99716      1143  SQL Symphony Concert  20171206
1      99716      1143  SQL Symphony Concert  20171212
2      99716      1143  SQL Symphony Concert  20171229

In [ ]:
#JEREMY ES EL ASESINO 
# Miranda Priestly la instigadora